export const biography = {
  p1: `Привет, я молодой разработчик, специализирующийся на React, и имею за плечами год опыта в сфере информационных технологий. Мое отличительное черта - это позитивный настрой и страсть к миру IT. Я всегда готов делиться позитивом и энергией в команде, что помогает нам успешно взаимодействовать и находить нестандартные, инновационные решения для сложных задач.`,
  p2: `Мои проекты всегда заканчиваются успешно, и я не боюсь браться за решение проблем, которые могут возникнуть на пути к цели. Я страстно увлечен разработкой на React и всегда стремлюсь к совершенству в этой области.`,
  p3: `Надеюсь, стать частью вашей команды и вместе достичь отличных результатов, создавая инновационные решения и улучшая пользовательский опыт. Давайте сделаем будущее IT ярче и более успешным вместе!`,
};

export const skills = [
  { name: 'HTML', x: '2vw', y: '-7vw' },
  { name: 'CSS', x: '8vw', y: '3vw' },
  { name: 'JavaScript', x: '-10vw', y: '3vw' },
  { name: 'TypeScript', x: '15vw', y: '-2vw' },
  { name: 'React', x: '1vw', y: '9vw' },
  { name: 'Redux Toolkit', x: '-12vw', y: '-5vw' },
  { name: 'Next.js', x: '-15vw', y: '10vw' },
  { name: 'Git/Github', x: '15vw', y: '8vw' },
  { name: 'Webpack', x: '5vw', y: '-15vw' },
  { name: 'Vite', x: '15vw', y: '-10vw' },
  { name: 'SASS/SCSS', x: '-10vw', y: '-13vw' },
  { name: 'Bootstrap', x: '25vw', y: '3vw' },
  { name: 'Firebase', x: '-23vw', y: '3vw' },
  { name: 'Figma', x: '-23vw', y: '-7vw' },
  { name: 'TailwindCSS', x: '25vw', y: '-8vw' },
];

export const experience = [
  {
    position: 'Frontend-разработчик',
    company: 'Портфолио',
    companyLink: 'https://github.com/Hem1x',
    time: 'Июнь 2022 - наст.',
    address: 'Москва, Россия',
    work: `
        Разрабатывал компоненты и логику веб-приложения на стеке: React + TypeScript + Redux + NextJS. 
        Работал с API при помощи RTK Query и RTK Thunk. 
        Реализовывал авторизацию и приватные роуты благодаря NextJS + Firebase. 
        Улучшал производительность веб-приложения (оптимизация перерисовок, запросов и кэширование). 
        Работал с Git и Github (commit, branch, checkout, pull request, merge
    `,
  },
];

export const education = [
  {
    type: 'Цифровая трансформация, Бакалавр',
    time: '2022-2026',
    place: 'Московский политехнический университет (МПУ)',
    info: 'Программа ориентирована на подготовку специалистов работающих на стыке информационных технологий, экономики и управленческой деятельности. Формируется системный подход к управлению современными предприятиями на основе цифровых решений.',
  },
];
